<template>
  <button class="botao-denuncia">
    <p>Fazer denúncia</p>
    <svg xmlns="http://www.w3.org/2000/svg" width="45" height="45" viewBox="0 0 45 45" fill="none">
      <path
        d="M32.7415 16.3766H32.7579M32.7579 12.2684V7.13525M13.2784 43H7.57102C6.90886 43 6.24259 42.9057 5.63373 42.6453C3.65338 41.7946 2.6468 40.6692 2.17939 39.966C2.05254 39.7712 1.99021 39.5415 2.00125 39.3093C2.01229 39.0771 2.09613 38.8543 2.24089 38.6724C4.53695 35.622 9.85888 33.7811 13.2784 33.7811M13.2886 43H18.9939C19.6581 43 20.3223 42.9057 20.9312 42.6453C22.9136 41.7946 23.9181 40.6692 24.3876 39.966C24.5144 39.7712 24.5768 39.5415 24.5657 39.3093C24.5547 39.0771 24.4708 38.8543 24.3261 38.6724C22.03 35.622 16.7081 33.7811 13.2886 33.7811M43 11.8236C43 17.2479 38.4079 21.6472 32.7415 21.6472C32.0746 21.6472 31.4131 21.5857 30.7571 21.4627C30.2856 21.3746 30.0519 21.3315 29.8858 21.3561C29.7218 21.3807 29.4881 21.5037 29.0248 21.7538C27.6977 22.4613 26.1703 22.699 24.691 22.4283C25.2527 21.7354 25.634 20.9051 25.8042 20.0154C25.9067 19.4722 25.6525 18.9433 25.2712 18.5558C23.4907 16.767 22.4887 14.3474 22.4831 11.8236C22.4831 6.3993 27.0752 2 32.7415 2C38.4079 2 43 6.3993 43 11.8236ZM18.9837 23.0924C18.9815 24.601 18.3804 26.047 17.3125 27.1126C16.2446 28.1782 14.7972 28.7761 13.2886 28.775C12.5413 28.7761 11.801 28.63 11.1102 28.345C10.4193 28.06 9.79132 27.6417 9.26211 27.1141C8.73289 26.5864 8.3128 25.9596 8.02581 25.2696C7.73882 24.5796 7.59055 23.8398 7.58947 23.0924C7.59028 22.345 7.73835 21.6049 8.02522 20.9147C8.31209 20.2244 8.73214 19.5974 9.26138 19.0695C9.79062 18.5416 10.4187 18.1232 11.1097 17.838C11.8007 17.5529 12.5411 17.4067 13.2886 17.4078C14.7976 17.4067 16.2452 18.005 17.3132 19.071C18.3812 20.137 18.982 21.5835 18.9837 23.0924Z"
        stroke-width="3"
        stroke-linecap="round"
        stroke-linejoin="round"
      />
    </svg>
  </button>
</template>

<style scoped lang="scss">
button {
  position: fixed;
  z-index: 5;
  bottom: 30%;
  right: 15px;
  width: calc(var(--altura-componentes) * 1.1);
  height: calc(var(--altura-componentes) * 1.1);
  background-color: var(--vermelho);
  border: none;
  cursor: pointer;
  display: flex;
  align-items: center;
  justify-content: center;
  border-radius: 10px;
  display: flex;
  align-items: center;
  justify-content: center;
  gap: 10px;

  svg {
    stroke: var(--branco);
    width: calc(var(--tamanho-icones) * 1.5);
    height: calc(var(--tamanho-icones) * 1.5);
  }

  p {
    display: none;
    font-size: var(--texto-m);
  }
}

@media (min-width: 992px) {
  button {
    bottom: 3vh;
    right: 30px;
    width: calc(var(--largura-componentes) / 2);
    height: calc(var(--altura-componentes) * 1.3);

    p {
      display: block;
    }
  }
}
</style>
